Revit 2027 API
BuiltInFailures.DatumPlaneFailures.ScopeBoxWrongPosition Property
 The Highlighted Datum cannot be associated with the specified Scope Box because the Datum plane does not intersect the Scope Box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ScopeBoxWrongPosition { get; }
Public Shared ReadOnly Property ScopeBoxWrongPosition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ScopeBoxWrongPosition {
	FailureDefinitionId^ get ();
}
static member ScopeBoxWrongPosition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DatumPlaneFailures Class
Autodesk.Revit.DB Namespace